var dateid=['20191202','20191203','20191204','20191205','20191206','20191207','20191208','20191209','20191210',
'20191211','20191212','20191213','20191214','20191215','20191216','20191217','20191218','20191219','20191220',
'20191221','20191222','20191223','20191224','20191225','20191226','20191227','20191228','20191229','20191230',
'20191231','20200101','20200102','20200103','20200104','20200105','20200106','20200107','20200108','20200109','20200110',
'20200111','20200112','20200113','20200114','20200115','20200116','20200117','20200118','20200119','20200120',
'20200121','20200122','20200123','20200124','20200125','20200126','20200127','20200128','20200129','20200130',
'20200131','20200201','20200202','20200203','20200204','20200205','20200206','20200207','20200208','20200209','20200210',
'20200211','20200212','20200213','20200214','20200215','20200216','20200217','20200218','20200219','20200220',
'20200221','20200222','20200223','20200224','20200225','20200226','20200227','20200228','20200229',
'20200301','20200302','20200303','20200304','20200305','20200306','20200307','20200308','20200309','20200310',
'20200311','20200312','20200313','20200314','20200315','20200316','20200317','20200318','20200319','20200320',
'20200321','20200322','20200323','20200324','20200325','20200326','20200327','20200328','20200329','20200330',
'20200331','20200401','20200402','20200403','20200404','20200405','20200406','20200407','20200408','20200409','20200410',
'20200411','20200412','20200413','20200414','20200415','20200416','20200417','20200418','20200419','20200420',
'20200421','20200422','20200423','20200424','20200425','20200426','20200427','20200428','20200429','20200430',
'20200501','20200502','20200503','20200504','20200505','20200506','20200507','20200508','20200509','20200510',
'20200511','20200512','20200513','20200514','20200515','20200516','20200517','20200518','20200519','20200520'

]

function getList(dateid) {
var numberList=[];
for(var i=0;i<eventdate.length;i++)
{
if(eventdate[i]==dateid)
{
for(var j=0;j<20;j++) 
{
    numberList.push(eventnumber[i+j])
}
}
}
return numberList;
}
function getpie(dateid){
var numberList = [];
for(var i=0;i<quaddate.length;i++)
{
if(quaddate[i]==dateid)
{
if(quadclass[i]=='1') numberList[0]=quadnumber[i];
if(quadclass[i]=='2') numberList[1]=quadnumber[i];
if(quadclass[i]=='3') numberList[2]=quadnumber[i];
if(quadclass[i]=='4') numberList[3]=quadnumber[i];
}
}
return numberList;
}
var eventdate = [];
var eventcode = [];
var eventnumber = [];
$.ajax({
async:false,
url: "json/event.json",//json文件位置，文件名
type: "GET",//请求方式为get
dataType: "json", //返回数据格式为json
// traditional:true,
success: function(data) {//请求成功完成后要执行的方法 
for(var i=0;i<data.length;i++){
eventdate[i]=data[i].date;
eventcode[i]=data[i].eventcode;
eventnumber[i]=data[i].number;
}

}
})
var quaddate = [];
var quadclass = [];
var quadnumber = [];
$.ajax({
async:false,
url: "json/quad.json",//json文件位置，文件名
type: "GET",//请求方式为get
dataType: "json", //返回数据格式为json
// traditional:true,
success: function(data) {//请求成功完成后要执行的方法 
for(var i=0;i<data.length;i++){
quaddate[i]=data[i].date;
quadclass[i]=data[i].quadclass;
quadnumber[i]=data[i].number;
}

}
})
var dom = document.getElementById("anachart3");
var myChart = echarts.init(dom);
var options=[];
dateid.forEach(date=>{
var pielist = getpie(date);
options.push(
{
series: [
    {data: getList(date)},
    {data:[
        {value: pielist[0], name: '口头合作'},
        {value: pielist[1], name: '物质合作'},
        {value: pielist[2], name: '口头冲突'},
        {value: pielist[3], name: '物质冲突'}
    ]}
]
}
)
})
// console.log(options)

option = {
baseOption:{
timeline: {
axisType: 'category',
// realtime: false,
// loop: false,
autoPlay: true,
// currentIndex: 2,
playInterval: 1000,
// controlStyle: {
//     position: 'left'
// },
data: ['1202','1203','1204','1205','1206','1207','1208','1209','1210',
        '1211','1212','1213','1214','1215','1216','1217','1218','1219','1220',
        '1221','1222','1223','1224','1225','1226','1227','1228','1229','1230',
        '1231','0101','0102','0103','0104','0105','0106','0107','0108','0109','0110',
        '0111','0112','0113','0114','0115','0116','0117','0118','0119','0120',
        '0121','0122','0123','0124','0125','0126','0127','0128','0129','0130',
        '0131','0201','0202','0203','0204','0205','0206','0207','0208','0209','0210',
        '0211','0212','0213','0214','0215','0216','0217','0218','0219','0220',
        '0221','0222','0223','0224','0225','0226','0227','0228','0229',
        '0301','0302','0303','0304','0305','0306','0307','0308','0309','0310',
        '0311','0312','0313','0314','0315','0316','0317','0318','0319','0320',
        '0321','0322','0323','0324','0325','0326','0327','0328','0329','0330',
        '0331','0401','0402','0403','0404','0405','0406','0407','0408','0409','0410',
        '0411','0412','0413','0414','0415','0416','0417','0418','0419','0420',
        '0421','0422','0423','0424','0425','0426','0427','0428','0429','0430',
        '0501','0502','0503','0504','0505','0506','0507','0508','0509','0510',
        '0511','0512','0513','0514','0515','0516','0517','0518','0519','0520'
        ],
label: {
    formatter : function(s) {
        return (new Date(s)).getFullYear();
    }
}
},

tooltip: {
},
legend: {
left: 'right',
orient: 'vertical',
data: ['口头合作', '物质合作', '口头冲突', '物质冲突']
},

calculable : true,
grid: {
top: 80,
bottom: 100,
tooltip: {
    trigger: 'axis',
    axisPointer: {
        type: 'shadow',
        label: {
            show: true,
            formatter: function (params) {
                return params.value.replace('\n', '');
            }
        }
    }
}
},
title: {
    text: 'GDELT单日事件类型统计',
    subtext: '',
    left: 'center'
},
xAxis: [
{
    type: 'category',
    data: ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
    boundaryGap: true
}
],
yAxis: [
{
    type: 'value'
}
],
series: [
{
    name: 'number',
    type: 'line',
    barWidth: '50%',
},
{
    name: 'quad',
    type: 'pie',
    center: ['75%', '35%'],
    radius: '28%',
    z: 100,
    data: 
    [
        {value: 2342223, name: '口头合作'},
        {value: 530682, name: '物质合作'},
        {value: 431263, name: '口头冲突'},
        {value: 430124, name: '物质冲突'}
    ]
}
]
},
options:options
};
if (option && typeof option === "object") {
myChart.setOption(option, true);
}